# SaveOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SaveOptions Constructor
SaveOptions Class See Also
---
Default constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public SaveOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SaveOptions()
```

# Remarks
PreviewViewId will be InvalidElementId.
# See Also
SaveOptions Class
Autodesk.Revit.DB Namespace